app/views/messages/_form.html.erb

      <ul>
      <% @message.errors.full_messages.each do |message| %>
---
SELECT "messages".* FROM "messages"