app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.username = current_user.name

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("body", "created_at", "room_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["body", "hello"], ["created_at", "2014-05-21 19:58:49.730090"], ["room_id", 6], ["updated_at", "2014-05-21 19:58:49.730090"], ["username", "Another"]]