app/controllers/messages_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @messages = Message.all
    @message = Message.new
    @users = User.all