app/controllers/rooms_controller.rb

  def show
    @current_user = current_user
  	@room = Room.find(params[:id])
  	@messages = @room.messages
  	@message = Message.new
  	@users = User.all
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-21 19:11:17.210492"], ["name", "101"], ["updated_at", "2014-05-21 19:11:17.210492"]]

  def destroy
    Room.find(params[:id]).destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]