app/controllers/sessions_controller.rb

  def create
    if params[:name].present?
      session[:name] = params[:name]
      User.find_or_create_by(name: session[:name])
---
INSERT INTO "users" ("name") VALUES (?)  [["name", "newuser"]]
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'new' LIMIT 1